#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
module.main.data.http.ssh_keys: Reading...
module.main.data.http.ssh_keys: Read complete after 0s [id=https://github.com/browniebroke.keys]
module.main.aws_iam_role.ecs-service-role: Refreshing state... [id=ecs_service_role_prod]
module.main.aws_vpc.production-vpc: Refreshing state... [id=vpc-0d81564eaa594ca38]
module.main.aws_key_pair.production: Refreshing state... [id=production_key_pair]
module.main.aws_ecr_repository.app_ecr_repo: Refreshing state... [id=browniebroke]
module.main.aws_iam_role.ecs-host-role: Refreshing state... [id=ecs_host_role_prod]
module.main.aws_cloudwatch_log_group.django-log-group: Refreshing state... [id=/ecs/django-app]
module.main.aws_iam_role_policy.ecs-instance-role-policy: Refreshing state... [id=ecs_host_role_prod:ecs_instance_role_policy]
module.main.aws_iam_instance_profile.ecs: Refreshing state... [id=ecs_instance_profile_prod]
module.main.aws_iam_role_policy.ecs-service-role-policy: Refreshing state... [id=ecs_service_role_prod:ecs_service_role_policy]
module.main.aws_cloudwatch_log_stream.django-log-stream: Refreshing state... [id=django-app-log-stream]
module.main.aws_route_table.private-route-table: Refreshing state... [id=rtb-00c5532ff7b0e8b77]
module.main.aws_subnet.public-subnet-2: Refreshing state... [id=subnet-08f07f5c848e74bf2]
module.main.aws_route_table.public-route-table: Refreshing state... [id=rtb-0e5e332f3554afd52]
module.main.aws_subnet.private-subnet-1: Refreshing state... [id=subnet-0b7e7370180d1330e]
module.main.aws_subnet.public-subnet-1: Refreshing state... [id=subnet-0b941ea2876dd8206]
module.main.aws_subnet.private-subnet-2: Refreshing state... [id=subnet-0885ab64f53876dea]
module.main.aws_internet_gateway.production-igw: Refreshing state... [id=igw-0e1b36fc71216e447]
module.main.aws_security_group.load-balancer: Refreshing state... [id=sg-0fc25c88d90955847]
module.main.aws_alb_target_group.default-target-group: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-2:111579726218:targetgroup/production-tg/87ab9a57ea5c1917]
module.main.aws_security_group.ecs: Refreshing state... [id=sg-0851edd013e68d0f9]
module.main.aws_route_table_association.public-route-2-association: Refreshing state... [id=rtbassoc-081901621cf794c22]
module.main.aws_route.public-internet-igw-route: Refreshing state... [id=r-rtb-0e5e332f3554afd521080289494]
module.main.aws_eip.elastic-ip-for-nat-gw: Refreshing state... [id=eipalloc-0296fe061bbc7967e]
module.main.aws_route_table_association.private-route-2-association: Refreshing state... [id=rtbassoc-0a954648d147471e7]
module.main.aws_route_table_association.private-route-1-association: Refreshing state... [id=rtbassoc-0c844950c91aa67ce]
module.main.aws_route_table_association.public-route-1-association: Refreshing state... [id=rtbassoc-07c1e6ec69b6a785a]
module.main.aws_lb.production: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-2:111579726218:loadbalancer/app/production-alb/f8f32ef8ad02d30d]
module.main.aws_nat_gateway.nat-gw: Refreshing state... [id=nat-0ad42057fff432dd9]
module.main.aws_route.nat-gw-route: Refreshing state... [id=r-rtb-00c5532ff7b0e8b771080289494]
module.main.aws_alb_listener.ecs-alb-http-listener: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-2:111579726218:listener/app/production-alb/f8f32ef8ad02d30d/17ba6f18a6c4b7c3]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.main.aws_ecs_cluster.production will be created
  + resource "aws_ecs_cluster" "production" {
      + arn                = (known after apply)
      + capacity_providers = (known after apply)
      + id                 = (known after apply)
      + name               = "production-cluster"
      + tags_all           = (known after apply)
    }

  # module.main.aws_ecs_service.production will be created
  + resource "aws_ecs_service" "production" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = "arn:aws:iam::111579726218:role/ecs_service_role_prod"
      + id                                 = (known after apply)
      + launch_type                        = (known after apply)
      + name                               = "production-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "django-app"
          + container_port   = 8000
          + target_group_arn = "arn:aws:elasticloadbalancing:eu-west-2:111579726218:targetgroup/production-tg/87ab9a57ea5c1917"
        }
    }

  # module.main.aws_ecs_task_definition.app will be created
  + resource "aws_ecs_task_definition" "app" {
      + arn                   = (known after apply)
      + arn_without_revision  = (known after apply)
      + container_definitions = jsonencode(
            [
              + {
                  + command          = [
                      + "gunicorn",
                      + "-w",
                      + "3",
                      + "-b",
                      + ":8000",
                      + "hello_django.wsgi:application",
                    ]
                  + cpu              = 10
                  + environment      = []
                  + essential        = true
                  + image            = "111579726218.dkr.ecr.eu-west-2.amazonaws.com/browniebroke:latest"
                  + links            = []
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/ecs/django-app"
                          + awslogs-region        = "eu-west-2"
                          + awslogs-stream-prefix = "django-app-log-stream"
                        }
                    }
                  + memory           = 512
                  + name             = "django-app"
                  + portMappings     = [
                      + {
                          + containerPort = 8000
                          + hostPort      = 0
                          + protocol      = "tcp"
                        },
                    ]
                },
            ]
        )
      + family                = "django-app"
      + id                    = (known after apply)
      + network_mode          = (known after apply)
      + revision              = (known after apply)
      + skip_destroy          = false
      + tags_all              = (known after apply)
    }

  # module.main.aws_launch_configuration.ecs will be created
  + resource "aws_launch_configuration" "ecs" {
      + arn                         = (known after apply)
      + associate_public_ip_address = true
      + ebs_optimized               = (known after apply)
      + enable_monitoring           = true
      + iam_instance_profile        = "ecs_instance_profile_prod"
      + id                          = (known after apply)
      + image_id                    = "ami-0bd3976c0dbacc605"
      + instance_type               = "t2.micro"
      + key_name                    = "production_key_pair"
      + name                        = "production-cluster"
      + name_prefix                 = (known after apply)
      + security_groups             = [
          + "sg-0851edd013e68d0f9",
        ]
      + user_data                   = "52441bc47d0bd2e9a2a368429f6569c04828e443"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>